[Killed] Block removal mutation
repos/ProiectTSS/ProiectTSS/JocVideo.cs:18:9
         public List<int> Scoruri { get; private set; }
 
         public JocVideo(string nume, string platforma, int anulLansarii)
-        {
-            Nume = nume;
-            Platforma = platforma;
-            AnulLansarii = anulLansarii;
-            Faze = new List<string>(); // Inițializare listă faze
-            Scoruri = new List<int>();
-        }
+        {}
 
         public void AdaugaFaza(string faza)
killedBy: TesteTSS.JocVideoTests.Constructor_Test; TesteTSS.JocVideoTests.AdaugaFaza_Test; TesteTSS.JocVideoTests.AfisareFaze_Test

[Killed] Equality mutation
repos/ProiectTSS/ProiectTSS/JocVideo.cs:28:17
 
         public void AdaugaFaza(string faza)
         {
-            if (faza == null)
+            if (faza != null)
                 throw new ArgumentNullException(nameof(faza), "Faza nu poate fi null.");
 
killedBy: TesteTSS.JocVideoTests.AdaugaFaza_Test; TesteTSS.JocVideoTests.AfisareFaze_Test; TesteTSS.JocVideoTests.AdaugaFaza_NullInput_ThrowsException

[Killed] Statement mutation
repos/ProiectTSS/ProiectTSS/JocVideo.cs:29:17
         public void AdaugaFaza(string faza)
         {
             if (faza == null)
-                throw new ArgumentNullException(nameof(faza), "Faza nu poate fi null.");
+                ;
 
             Faze.Add(faza);
killedBy: TesteTSS.JocVideoTests.AdaugaFaza_NullInput_ThrowsException; TesteTSS.JocVideoTests.AdaugaFaza_NullInput_ThrowsArgumentNullExceptionWithCorrectMessage

[Killed] Statement mutation
repos/ProiectTSS/ProiectTSS/JocVideo.cs:31:13
             if (faza == null)
                 throw new ArgumentNullException(nameof(faza), "Faza nu poate fi null.");
 
-            Faze.Add(faza);
+            ;
         }
 
killedBy: TesteTSS.JocVideoTests.AdaugaFaza_Test; TesteTSS.JocVideoTests.AfisareFaze_Test

[Killed] Equality mutation
repos/ProiectTSS/ProiectTSS/JocVideo.cs:36:17
 
         public void AdaugaScor(int scor)
         {
-            if (scor < 0)
+            if (scor <= 0)
                 throw new ArgumentException("Scorul nu poate fi negativ.");
 
killedBy: TesteTSS.JocVideoTests.AdaugaScor_ScorZero_Test

[Killed] Negate expression
repos/ProiectTSS/ProiectTSS/JocVideo.cs:36:17
 
         public void AdaugaScor(int scor)
         {
-            if (scor < 0)
+            if (!(scor < 0))
                 throw new ArgumentException("Scorul nu poate fi negativ.");
 
killedBy: TesteTSS.JocVideoTests.AdaugaScor_ScorZero_Test; TesteTSS.JocVideoTests.AdaugaScor_ScorMaxim_Test; TesteTSS.JocVideoTests.AdaugaScor_ScorNegativ_Test

[Killed] Statement mutation
repos/ProiectTSS/ProiectTSS/JocVideo.cs:37:17
         public void AdaugaScor(int scor)
         {
             if (scor < 0)
-                throw new ArgumentException("Scorul nu poate fi negativ.");
+                ;
 
             Scoruri.Add(scor);
killedBy: TesteTSS.JocVideoTests.AdaugaScor_ScorNegativ_Test

[Survived] String mutation
repos/ProiectTSS/ProiectTSS/JocVideo.cs:37:45
         public void AdaugaScor(int scor)
         {
             if (scor < 0)
-                throw new ArgumentException("Scorul nu poate fi negativ.");
+                throw new ArgumentException("");
 
             Scoruri.Add(scor);

[Killed] Statement mutation
repos/ProiectTSS/ProiectTSS/JocVideo.cs:39:13
             if (scor < 0)
                 throw new ArgumentException("Scorul nu poate fi negativ.");
 
-            Scoruri.Add(scor);
+            ;
         }
 
killedBy: TesteTSS.JocVideoTests.AdaugaScor_ScorZero_Test; TesteTSS.JocVideoTests.AdaugaScor_ScorMaxim_Test; TesteTSS.JocVideoTests.AdaugaScor_MultipleValidScores_Test

[Killed] Statement mutation
repos/ProiectTSS/ProiectTSS/JocVideo.cs:45:13
         // Funcția cu for - AfisareFaze()
         public void AfisareFaze()
         {
-            Console.WriteLine($"Fazele jocului {Nume}:");
+            ;
             for (int i = 0; i < Faze.Count; i++)
             {
killedBy: TesteTSS.JocVideoTests.AfisareFaze_ListaGoala_ContineDoarTitlul_Test

[Killed] String mutation
repos/ProiectTSS/ProiectTSS/JocVideo.cs:45:31
         // Funcția cu for - AfisareFaze()
         public void AfisareFaze()
         {
-            Console.WriteLine($"Fazele jocului {Nume}:");
+            Console.WriteLine($"");
             for (int i = 0; i < Faze.Count; i++)
             {
killedBy: TesteTSS.JocVideoTests.AfisareFaze_ListaGoala_ContineDoarTitlul_Test

[Killed] Equality mutation
repos/ProiectTSS/ProiectTSS/JocVideo.cs:46:29
         public void AfisareFaze()
         {
             Console.WriteLine($"Fazele jocului {Nume}:");
-            for (int i = 0; i < Faze.Count; i++)
+            for (int i = 0; i <= Faze.Count; i++)
             {
                 Console.WriteLine($"Faza {i + 1}: {Faze[i]}");
killedBy: TesteTSS.JocVideoTests.AfisareFaze_Test; TesteTSS.JocVideoTests.AfisareFaze_ListaGoala_ContineDoarTitlul_Test

[Killed] PostIncrementExpression to PostDecrementExpression mutation
repos/ProiectTSS/ProiectTSS/JocVideo.cs:46:45
         public void AfisareFaze()
         {
             Console.WriteLine($"Fazele jocului {Nume}:");
-            for (int i = 0; i < Faze.Count; i++)
+            for (int i = 0; i < Faze.Count; i--)
             {
                 Console.WriteLine($"Faza {i + 1}: {Faze[i]}");
killedBy: TesteTSS.JocVideoTests.AfisareFaze_Test

[Killed] Statement mutation
repos/ProiectTSS/ProiectTSS/JocVideo.cs:48:17
             Console.WriteLine($"Fazele jocului {Nume}:");
             for (int i = 0; i < Faze.Count; i++)
             {
-                Console.WriteLine($"Faza {i + 1}: {Faze[i]}");
+                ;
             }
         }
killedBy: TesteTSS.JocVideoTests.AfisareFaze_Test

[Survived] Arithmetic mutation
repos/ProiectTSS/ProiectTSS/JocVideo.cs:48:43
             Console.WriteLine($"Fazele jocului {Nume}:");
             for (int i = 0; i < Faze.Count; i++)
             {
-                Console.WriteLine($"Faza {i + 1}: {Faze[i]}");
+                Console.WriteLine($"Faza {i - 1}: {Faze[i]}");
             }
         }

[Killed] Equality mutation
repos/ProiectTSS/ProiectTSS/JocVideo.cs:55:17
         // Funcția cu if-else - VerificaCompatibilitate()
         public void VerificaCompatibilitate(string platformaCautata)
         {
-            if (platformaCautata == null)
+            if (platformaCautata != null)
             {
                 throw new ArgumentNullException(nameof(platformaCautata), "Platforma cautata nu poate fi null.");
killedBy: TesteTSS.JocVideoTests.VerificaCompatibilitate_TestCompatibil; TesteTSS.JocVideoTests.VerificaCompatibilitate_TestIncompatibil; TesteTSS.JocVideoTests.VerificaCompatibilitate_Compatibil_CazulSensitiv_Test

[Killed] Statement mutation
repos/ProiectTSS/ProiectTSS/JocVideo.cs:57:17
         {
             if (platformaCautata == null)
             {
-                throw new ArgumentNullException(nameof(platformaCautata), "Platforma cautata nu poate fi null.");
+                ;
             }
 
killedBy: TesteTSS.JocVideoTests.VerificaCompatibilitate_Null_Test

[Survived] String mutation
repos/ProiectTSS/ProiectTSS/JocVideo.cs:57:75
         {
             if (platformaCautata == null)
             {
-                throw new ArgumentNullException(nameof(platformaCautata), "Platforma cautata nu poate fi null.");
+                throw new ArgumentNullException(nameof(platformaCautata), "");
             }
 

[Killed] Equality mutation
repos/ProiectTSS/ProiectTSS/JocVideo.cs:60:17
                 throw new ArgumentNullException(nameof(platformaCautata), "Platforma cautata nu poate fi null.");
             }
 
-            if (Platforma.ToLower() == platformaCautata.ToLower())
+            if (Platforma.ToLower() != platformaCautata.ToLower())
             {
                 Console.WriteLine($"{Nume} este disponibil pe {platformaCautata}.");
killedBy: TesteTSS.JocVideoTests.VerificaCompatibilitate_TestCompatibil; TesteTSS.JocVideoTests.VerificaCompatibilitate_TestIncompatibil; TesteTSS.JocVideoTests.VerificaCompatibilitate_Compatibil_CazulSensitiv_Test

[Killed] Statement mutation
repos/ProiectTSS/ProiectTSS/JocVideo.cs:62:17
 
             if (Platforma.ToLower() == platformaCautata.ToLower())
             {
-                Console.WriteLine($"{Nume} este disponibil pe {platformaCautata}.");
+                ;
             }
             else
killedBy: TesteTSS.JocVideoTests.VerificaCompatibilitate_TestCompatibil; TesteTSS.JocVideoTests.VerificaCompatibilitate_Compatibil_CazulSensitiv_Test; TesteTSS.JocVideoTests.VerificaCompatibilitate_CaseInsensitive_Test

[Killed] Statement mutation
repos/ProiectTSS/ProiectTSS/JocVideo.cs:66:17
             }
             else
             {
-                Console.WriteLine($"{Nume} nu este disponibil pe {platformaCautata}.");
+                ;
             }
         }
killedBy: TesteTSS.JocVideoTests.VerificaCompatibilitate_TestIncompatibil; TesteTSS.JocVideoTests.VerificaCompatibilitate_Incompatibil_Test
