[NoCoverage] Statement mutation
repos/ProiectTSS/ProiectTSS/Meniu.cs:11:13
     {
         while (true)
         {
-            Console.WriteLine("1. Afiseaza toate jocurile");
+            ;
             Console.WriteLine("2. Adauga un joc nou");
             Console.WriteLine("3. Sterge un joc");

[NoCoverage] Statement mutation
repos/ProiectTSS/ProiectTSS/Meniu.cs:12:13
         while (true)
         {
             Console.WriteLine("1. Afiseaza toate jocurile");
-            Console.WriteLine("2. Adauga un joc nou");
+            ;
             Console.WriteLine("3. Sterge un joc");
             Console.WriteLine("4. Afiseaza fazele unui joc");

[NoCoverage] String mutation
repos/ProiectTSS/ProiectTSS/Meniu.cs:12:31
         while (true)
         {
             Console.WriteLine("1. Afiseaza toate jocurile");
-            Console.WriteLine("2. Adauga un joc nou");
+            Console.WriteLine("");
             Console.WriteLine("3. Sterge un joc");
             Console.WriteLine("4. Afiseaza fazele unui joc");

[NoCoverage] Statement mutation
repos/ProiectTSS/ProiectTSS/Meniu.cs:13:13
         {
             Console.WriteLine("1. Afiseaza toate jocurile");
             Console.WriteLine("2. Adauga un joc nou");
-            Console.WriteLine("3. Sterge un joc");
+            ;
             Console.WriteLine("4. Afiseaza fazele unui joc");
             Console.WriteLine("5. Iesire");

[NoCoverage] Statement mutation
repos/ProiectTSS/ProiectTSS/Meniu.cs:14:13
             Console.WriteLine("1. Afiseaza toate jocurile");
             Console.WriteLine("2. Adauga un joc nou");
             Console.WriteLine("3. Sterge un joc");
-            Console.WriteLine("4. Afiseaza fazele unui joc");
+            ;
             Console.WriteLine("5. Iesire");
             Console.Write("Alege o optiune: ");

[NoCoverage] Statement mutation
repos/ProiectTSS/ProiectTSS/Meniu.cs:15:13
             Console.WriteLine("2. Adauga un joc nou");
             Console.WriteLine("3. Sterge un joc");
             Console.WriteLine("4. Afiseaza fazele unui joc");
-            Console.WriteLine("5. Iesire");
+            ;
             Console.Write("Alege o optiune: ");
             int optiune = Convert.ToInt32(Console.ReadLine());

[NoCoverage] String mutation
repos/ProiectTSS/ProiectTSS/Meniu.cs:15:31
             Console.WriteLine("2. Adauga un joc nou");
             Console.WriteLine("3. Sterge un joc");
             Console.WriteLine("4. Afiseaza fazele unui joc");
-            Console.WriteLine("5. Iesire");
+            Console.WriteLine("");
             Console.Write("Alege o optiune: ");
             int optiune = Convert.ToInt32(Console.ReadLine());

[NoCoverage] Statement mutation
repos/ProiectTSS/ProiectTSS/Meniu.cs:16:13
             Console.WriteLine("3. Sterge un joc");
             Console.WriteLine("4. Afiseaza fazele unui joc");
             Console.WriteLine("5. Iesire");
-            Console.Write("Alege o optiune: ");
+            ;
             int optiune = Convert.ToInt32(Console.ReadLine());
 

[NoCoverage] Statement mutation
repos/ProiectTSS/ProiectTSS/Meniu.cs:22:21
             switch (optiune)
             {
                 case 1:
-                    AfisareJocuri();
+                    ;
                     break;
                 case 2:

[NoCoverage] Statement mutation
repos/ProiectTSS/ProiectTSS/Meniu.cs:25:21
                     AfisareJocuri();
                     break;
                 case 2:
-                    AdaugaJoc();
+                    ;
                     break;
                 case 3:

[NoCoverage] Statement mutation
repos/ProiectTSS/ProiectTSS/Meniu.cs:28:21
                     AdaugaJoc();
                     break;
                 case 3:
-                    StergeJoc();
+                    ;
                     break;
                 case 4:

[NoCoverage] Statement mutation
repos/ProiectTSS/ProiectTSS/Meniu.cs:31:21
                     StergeJoc();
                     break;
                 case 4:
-                    AfisareFazeJoc();
+                    ;
                     break;
                 case 5:

[NoCoverage] Statement mutation
repos/ProiectTSS/ProiectTSS/Meniu.cs:36:21
                 case 5:
                     return;
                 default:
-                    Console.WriteLine("Optiune invalida! Incercati din nou.");
+                    ;
                     break;
             }

[NoCoverage] Statement mutation
repos/ProiectTSS/ProiectTSS/Meniu.cs:44:9
 
     private void AdaugaJoc()
     {
-        Console.Write("Introdu numele jocului: ");
+        ;
         string nume = Console.ReadLine();
         Console.Write("Introdu platforma: ");

[NoCoverage] String mutation
repos/ProiectTSS/ProiectTSS/Meniu.cs:44:23
 
     private void AdaugaJoc()
     {
-        Console.Write("Introdu numele jocului: ");
+        Console.Write("");
         string nume = Console.ReadLine();
         Console.Write("Introdu platforma: ");

[NoCoverage] Statement mutation
repos/ProiectTSS/ProiectTSS/Meniu.cs:46:9
     {
         Console.Write("Introdu numele jocului: ");
         string nume = Console.ReadLine();
-        Console.Write("Introdu platforma: ");
+        ;
         string platforma = Console.ReadLine();
         Console.Write("Introdu anul lansarii: ");

[NoCoverage] String mutation
repos/ProiectTSS/ProiectTSS/Meniu.cs:46:23
     {
         Console.Write("Introdu numele jocului: ");
         string nume = Console.ReadLine();
-        Console.Write("Introdu platforma: ");
+        Console.Write("");
         string platforma = Console.ReadLine();
         Console.Write("Introdu anul lansarii: ");

[NoCoverage] Statement mutation
repos/ProiectTSS/ProiectTSS/Meniu.cs:48:9
         string nume = Console.ReadLine();
         Console.Write("Introdu platforma: ");
         string platforma = Console.ReadLine();
-        Console.Write("Introdu anul lansarii: ");
+        ;
         int anulLansarii = Convert.ToInt32(Console.ReadLine());
 

[NoCoverage] Statement mutation
repos/ProiectTSS/ProiectTSS/Meniu.cs:53:9
 
         JocVideo joc = new JocVideo(nume, platforma, anulLansarii);
 
-        Console.Write("Cate faze doresti sa adaugi? ");
+        ;
         int numarFaze = Convert.ToInt32(Console.ReadLine());
         for (int i = 0; i < numarFaze; i++)

[NoCoverage] String mutation
repos/ProiectTSS/ProiectTSS/Meniu.cs:53:23
 
         JocVideo joc = new JocVideo(nume, platforma, anulLansarii);
 
-        Console.Write("Cate faze doresti sa adaugi? ");
+        Console.Write("");
         int numarFaze = Convert.ToInt32(Console.ReadLine());
         for (int i = 0; i < numarFaze; i++)

[NoCoverage] Equality mutation
repos/ProiectTSS/ProiectTSS/Meniu.cs:55:25
 
         Console.Write("Cate faze doresti sa adaugi? ");
         int numarFaze = Convert.ToInt32(Console.ReadLine());
-        for (int i = 0; i < numarFaze; i++)
+        for (int i = 0; i > numarFaze; i++)
         {
             Console.Write($"Introdu numele fazei {i + 1}: ");

[NoCoverage] Equality mutation
repos/ProiectTSS/ProiectTSS/Meniu.cs:55:25
 
         Console.Write("Cate faze doresti sa adaugi? ");
         int numarFaze = Convert.ToInt32(Console.ReadLine());
-        for (int i = 0; i < numarFaze; i++)
+        for (int i = 0; i <= numarFaze; i++)
         {
             Console.Write($"Introdu numele fazei {i + 1}: ");

[NoCoverage] Arithmetic mutation
repos/ProiectTSS/ProiectTSS/Meniu.cs:57:51
         int numarFaze = Convert.ToInt32(Console.ReadLine());
         for (int i = 0; i < numarFaze; i++)
         {
-            Console.Write($"Introdu numele fazei {i + 1}: ");
+            Console.Write($"Introdu numele fazei {i - 1}: ");
             string numeFaza = Console.ReadLine();
             joc.AdaugaFaza(numeFaza);

[NoCoverage] Statement mutation
repos/ProiectTSS/ProiectTSS/Meniu.cs:57:13
         int numarFaze = Convert.ToInt32(Console.ReadLine());
         for (int i = 0; i < numarFaze; i++)
         {
-            Console.Write($"Introdu numele fazei {i + 1}: ");
+            ;
             string numeFaza = Console.ReadLine();
             joc.AdaugaFaza(numeFaza);

[NoCoverage] Statement mutation
repos/ProiectTSS/ProiectTSS/Meniu.cs:59:13
         {
             Console.Write($"Introdu numele fazei {i + 1}: ");
             string numeFaza = Console.ReadLine();
-            joc.AdaugaFaza(numeFaza);
+            ;
         }
 

[NoCoverage] Statement mutation
repos/ProiectTSS/ProiectTSS/Meniu.cs:62:9
             joc.AdaugaFaza(numeFaza);
         }
 
-        jocuri.Add(joc);
+        ;
         Console.WriteLine("Joc adaugat cu succes!");
 

[NoCoverage] Statement mutation
repos/ProiectTSS/ProiectTSS/Meniu.cs:63:9
         }
 
         jocuri.Add(joc);
-        Console.WriteLine("Joc adaugat cu succes!");
+        ;
 
         Console.Write("Doresti sa verifici compatibilitatea jocului cu o platforma? (da/nu) ");

[NoCoverage] Statement mutation
repos/ProiectTSS/ProiectTSS/Meniu.cs:65:9
         jocuri.Add(joc);
         Console.WriteLine("Joc adaugat cu succes!");
 
-        Console.Write("Doresti sa verifici compatibilitatea jocului cu o platforma? (da/nu) ");
+        ;
         if (Console.ReadLine().ToLower() == "da")
         {

[NoCoverage] Equality mutation
repos/ProiectTSS/ProiectTSS/Meniu.cs:66:13
         Console.WriteLine("Joc adaugat cu succes!");
 
         Console.Write("Doresti sa verifici compatibilitatea jocului cu o platforma? (da/nu) ");
-        if (Console.ReadLine().ToLower() == "da")
+        if (Console.ReadLine().ToLower() != "da")
         {
             Console.Write("Introdu platforma pentru verificare: ");

[NoCoverage] Statement mutation
repos/ProiectTSS/ProiectTSS/Meniu.cs:68:13
         Console.Write("Doresti sa verifici compatibilitatea jocului cu o platforma? (da/nu) ");
         if (Console.ReadLine().ToLower() == "da")
         {
-            Console.Write("Introdu platforma pentru verificare: ");
+            ;
             string platformaVerificare = Console.ReadLine();
             joc.VerificaCompatibilitate(platformaVerificare);

[NoCoverage] String mutation
repos/ProiectTSS/ProiectTSS/Meniu.cs:68:27
         Console.Write("Doresti sa verifici compatibilitatea jocului cu o platforma? (da/nu) ");
         if (Console.ReadLine().ToLower() == "da")
         {
-            Console.Write("Introdu platforma pentru verificare: ");
+            Console.Write("");
             string platformaVerificare = Console.ReadLine();
             joc.VerificaCompatibilitate(platformaVerificare);

[NoCoverage] Statement mutation
repos/ProiectTSS/ProiectTSS/Meniu.cs:70:13
         {
             Console.Write("Introdu platforma pentru verificare: ");
             string platformaVerificare = Console.ReadLine();
-            joc.VerificaCompatibilitate(platformaVerificare);
+            ;
         }
     }

[NoCoverage] Statement mutation
repos/ProiectTSS/ProiectTSS/Meniu.cs:76:9
 
     private void StergeJoc()
     {
-        Console.Write("Introdu numele jocului de sters: ");
+        ;
         string nume = Console.ReadLine();
         JocVideo jocDeSters = jocuri.Find(j => j.Nume == nume);

[NoCoverage] Equality mutation
repos/ProiectTSS/ProiectTSS/Meniu.cs:78:48
     {
         Console.Write("Introdu numele jocului de sters: ");
         string nume = Console.ReadLine();
-        JocVideo jocDeSters = jocuri.Find(j => j.Nume == nume);
+        JocVideo jocDeSters = jocuri.Find(j => j.Nume != nume);
         if (jocDeSters != null)
         {

[NoCoverage] Equality mutation
repos/ProiectTSS/ProiectTSS/Meniu.cs:79:13
         Console.Write("Introdu numele jocului de sters: ");
         string nume = Console.ReadLine();
         JocVideo jocDeSters = jocuri.Find(j => j.Nume == nume);
-        if (jocDeSters != null)
+        if (jocDeSters == null)
         {
             jocuri.Remove(jocDeSters);

[NoCoverage] Statement mutation
repos/ProiectTSS/ProiectTSS/Meniu.cs:81:13
         JocVideo jocDeSters = jocuri.Find(j => j.Nume == nume);
         if (jocDeSters != null)
         {
-            jocuri.Remove(jocDeSters);
+            ;
             Console.WriteLine("Joc sters cu succes!");
         }

[NoCoverage] Statement mutation
repos/ProiectTSS/ProiectTSS/Meniu.cs:82:13
         if (jocDeSters != null)
         {
             jocuri.Remove(jocDeSters);
-            Console.WriteLine("Joc sters cu succes!");
+            ;
         }
         else

[NoCoverage] Statement mutation
repos/ProiectTSS/ProiectTSS/Meniu.cs:86:13
         }
         else
         {
-            Console.WriteLine("Jocul nu a fost gasit!");
+            ;
         }
     }

[NoCoverage] Statement mutation
repos/ProiectTSS/ProiectTSS/Meniu.cs:94:13
     {
         foreach (var joc in jocuri)
         {
-            Console.WriteLine(joc);
+            ;
         }
     }

[NoCoverage] Statement mutation
repos/ProiectTSS/ProiectTSS/Meniu.cs:101:9
 
     private void AfisareFazeJoc()
     {
-        Console.Write("Introdu numele jocului pentru care vrei sa vezi fazele: ");
+        ;
         string numeJoc = Console.ReadLine();
         JocVideo joc = jocuri.Find(j => j.Nume.ToLower() == numeJoc.ToLower());

[NoCoverage] Equality mutation
repos/ProiectTSS/ProiectTSS/Meniu.cs:103:41
     {
         Console.Write("Introdu numele jocului pentru care vrei sa vezi fazele: ");
         string numeJoc = Console.ReadLine();
-        JocVideo joc = jocuri.Find(j => j.Nume.ToLower() == numeJoc.ToLower());
+        JocVideo joc = jocuri.Find(j => j.Nume.ToLower() != numeJoc.ToLower());
         if (joc != null)
         {

[NoCoverage] Equality mutation
repos/ProiectTSS/ProiectTSS/Meniu.cs:104:13
         Console.Write("Introdu numele jocului pentru care vrei sa vezi fazele: ");
         string numeJoc = Console.ReadLine();
         JocVideo joc = jocuri.Find(j => j.Nume.ToLower() == numeJoc.ToLower());
-        if (joc != null)
+        if (joc == null)
         {
             joc.AfisareFaze();

[NoCoverage] Statement mutation
repos/ProiectTSS/ProiectTSS/Meniu.cs:106:13
         JocVideo joc = jocuri.Find(j => j.Nume.ToLower() == numeJoc.ToLower());
         if (joc != null)
         {
-            joc.AfisareFaze();
+            ;
         }
         else

[NoCoverage] String mutation
repos/ProiectTSS/ProiectTSS/Meniu.cs:110:31
         }
         else
         {
-            Console.WriteLine("Jocul nu a fost gasit!");
+            Console.WriteLine("");
         }
     }
