[NoCoverage] Statement mutation
repos/ProiectTSS/ProiectTSS/Program.cs:6:9
     static void Main(string[] args)
     {
         Meniu meniu = new Meniu();
-        meniu.AfisareMeniu();
+        ;
     }
 }
